export const HEXAGRAM_SEQUENCE = [
    '坤','剥','比','观','豫','晋','萃','否',
    '谦','艮','蹇','渐','小过','旅','咸','遁',
    '师','蒙','坎','涣','解','未济','困','讼',
    '升','蛊','井','巽','恒','鼎','大过','姤',
    '复','颐','屯','益','震','噬嗑','随','无妄',
    '明夷','贲', '既济', '家人', '丰','离','革', '同人', 
    '临', '损', '节', '中孚', '归妹', '睽', '兑', '履', 
    '泰', '大畜', '需', '小畜', '大壮', '大有', '夬','乾'
]

export const CIRCLE_SEQUENCE = [
    29,28,27, 26,25,24,23,22,21,20,19,17,16,15,14,13,12,11,10,9,8,7,6,5,4,3,2,1,32,33,34,35,36,37,38,39,40,41,42,43,44,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,31,30
]

export const FULL_CIRCLE = [
    '复','颐','屯','益','震','噬嗑','随','无妄',
    '明夷','贲', '既济', '家人', '丰','离','革', '同人', 
    '临', '损', '节', '中孚', '归妹', '睽', '兑', '履', 
    '泰', '大畜', '需', '小畜', '大壮', '大有', '夬','乾',
    '姤', '大过', '鼎', '恒', '巽', '井', '蛊', '升',
    '讼', '困', '未济', '解', '涣', '坎', '蒙', '师',
    '遁', '咸', '旅', '小过', '渐', '蹇', '艮', '谦',
    '否', '萃', '晋', '豫', '观', '比', '剥', '坤'
]

export const STEMS = [
    '甲','乙','丙','丁','戊','己','庚','辛','壬','癸'
]

export const ZODIACS = [
    '子','丑','寅',
    '卯','辰','巳',
    '午','未','申',
    '酉','戌','亥'
]

export const PILLARS = [
    45,63,18,0
]

export const TERMS = [
    '立春','雨水','惊蛰','春分','清明','谷雨',
    '立夏','小满','芒种','夏至','小暑','大暑',
    '立秋','处暑','白露','秋分','寒露','霜降',
    '立冬','小雪','大雪','冬至','小寒','大寒'
]